# 运算符
print('-----------加法运算-----------')
print(1 + 1)  # 加法运算
print('-----------减法运算-----------')
print(1 - 1)  # 减法运算
print('-----------乘法运算-----------')
print(2 * 4)  # 乘法运算
print('-----------自然除-----------')
print(1 / 2)  # 自然除运算
print('-----------整除-----------')
print(1 // 2)  # 整除运算  向下取整
print('-----------取余运算-----------')
print(11 % 2)  # 取余运算  公式：余数 = 被除数 - 除数 * 商
print('-----------平方运算-----------')
print(2 ** 2)  # 平方运算
print('-----------次方运算-----------')
print(2 ** 3)  # 次方运算


# 赋值运算符   运算顺序从右到左
x = 1 + 2  # -、*、/、//、%
print(x)
print('-----------链式赋值-----------')
a = b = c = 10  # 链式赋值
print(a, b, c)
print('-----------参数赋值-----------')
y = 10
y += 20  # 参数赋值  y = y + 20
print(y)
print('-----------解包赋值-----------')
e, d, f = 10, 20, 30  # 解包赋值 左右个数要一样
print(e, d, f)
print('----------交换变量的值-----------')
i, n = 10, 20
print('交换之前:', i, n)
i, n = n, i  # 交换
print('交换之后:', i, n)


# 比较运算符，比较结果为bool型
x, y = 10, 20
print('>:', x > y)  # x大于y  false
print('<:', x < y)  # x小于y  true
print('>=:', x >= y)  # x大于等于y  false
print('<=:', x <= y)  # x小于等于y  true
print('==:', x == y)  # x等于y  false
print('!=:', x != y)  # x不等于y true
x, y = 10, 10
print(x == y)  # value比较 true
print(x is y)  # id比较 true 相等吗
print(x is not y)  # id比较 false 不相等吗
